doc/Dot_Class_VCCE.md
```dot
digraph {
rankdir=BT

node [shape="record"]

"Connector" -> "VCCycle"
  [arrowhead="diamond", arrowtail="none",fontcolor="blue",
  label="1..*", style="solid"]

{ "Compressor",
  "Condenser",
  "Evaporator",
  "ExpansionValve"} -> "VCCycle"
  [arrowhead="odiamond", arrowtail="none",fontcolor="blue",
  label="1..*", style="solid"]

"Port"-> {
    "Connector",
    "ExpansionValve",
    "Evaporator",
    "Condenser",
    "Compressor"}
    [arrowhead="diamond", arrowtail="none",
     fontcolor="blue",label="2", style="solid"]
} 
```
